<2. 인공지능 윤리의 개념과 핵심 내용 및 그 사례>
[4차 산업 시대 직업의 변화]

[4차 산업 시대에 사라지거나 정체될 직업]

[10년 전 존재하지 않았던 현재의 유망 직업들]

[4차산업시대에 유망한 직업]
1. 기술 기반

2. 인간 특화 기술

3. 새로운 전문 분야

..

[4차 산업 시대의 유망 직업 분석]
.. 
단순 기술보다는 창조력과 고도의 문제 해결 능력을 기르는 ..

[KAIEA 4차산업시대 유망 직업 BEST 7]
..
7. => 자기가 하고 싶은 일 잘하는 일.. (가치 있는 일)

[4차 산업시대에 갖춰야 할 3대 능력]
1. 인성
2. 창의력
3. 기술활용능력

[인공지능 기술로 인한 우려되는 점]


[인공지능 윤리]
: 의무론 / 공리주의 / 덕윤리 
  => 포스트 휴머니즘 (탈인간중심)
    => 트랜스 휴머니즘 (인간중심)
      => 인공지능 윤리

-> 각각의 찬성/반대 관점을 살펴보기.

[딥페이크 사례 - GAN 기술]

[딥러닝 기반 이미지 렌더링 기술]

[ai 면접관]


** 편향된 데이터가 되지 않도록 정제.
*** 인공지능 알고리즘 - 편협된 사고방식을 가진 사람이 만들면?

[트롤리 딜레마 문제]

[지울주행차의 딜레마 문제] 공리주의

* 사회 기술, 문화 등등 각 나라마다 맞는 요소가 다르다.

[자율주행차 알고리즘 결정 주체?]

[인공지능 윤리의 5대 문제]
* 편향성 문제, 악용 문제가 제일 심각.

kill switch

[개인정보 보호 문제]

