<인공지능 윤리 교육_240401>
<1. 4차산업혁명 시대, AI 기술과 인간 삶의 변화>

- 플라잉보드

- 애니악 (1946년도에 나옴)
  -> 스마트폰
    -> 스마트 글래스

[1-1. 4차 산업 시대의 가장 큰 변화상]
- 초지능, 초연결, 초융합, 초공유의 사회
=> 초지능:
=> 초연결:
=> 초융합:
=> 초공유:

- 생계유지를 위한 돈이 별로 필요없는 사회

[1-2. 삶의 혁신적 변화]
- 바이오, 헬스 분야가 각광 받고 있음. (예) 코로나 백신)
- 교육 (온라인으로 실시간으로 정보를 찾을 수 있음 -> 굳이 교육을 받는 것 보단 내가 하고 싶은 거?)

[1-3. 4차 산업시대의 인간 삶의 목적]

- 인공지능은 도구/수단. (인간이 목적이 되어야 한다.)
예1) SK - AI 스피커 / KT - 기가지니 / 등등..
예2) 드론구조팀
예3) 자살 예방 (데이터 수집 및 징후 분석 기능)


[1-4. 인공지능이란?] (Artificial Inteligence)
: 사람의 두뇌를 흉내애서 컴퓨터로 구현한 지적 능력 또는 인간의 능력.

[1-5. 인공지능 발달 과정]
: 학습을 시켜줘야 한다. (빅데이터를 통해) (구조화 및 데이터화)
: 컴퓨팅 중요 (CPU, GPU, ..)

[1-6. 인공지능 기술이 쓰이는 곳]
* 인공지능은 프로그래밍방식 / 학습방식(챗봇, 자율주행차)으로 나누어진다.

..
일자리 문제가 생길 수 있다.

[1-7. 인공지능의 구분]

인공지능 > 머신 러닝 > (딥러닝, 강화학습)

인공지능의 역할: 데이터를 통해 결과를 예측. 
머신러닝: 기계가 빅데이터를 통해 !스스로! 학습 및 성장.


[1-8. 머신러닝과 딥러닝의 차이]
- 머신러닝 (지도학습) => 결과값이 있는 데이터
- 딥러닝 (비지도학습) => 결과값이 없는 무작위의 데이터 + 인공신경망 알고리즘

[1-9. 딥러닝의 인공신경망]

[1-10. 강화학습]
(데이터가 필요 없음.)
스스로 경험 계속. (실수를 통한 배움)

[1-11. 알파고 VS 알파고제로]
알파고: 딥러닝(인공신경망) + 강화학습 방식
알파고 제로: 강화학습 방식 (고사양의 컴퓨팅이 필요 없다.)

[1-12. 뮤제로[Muzero] - 게임관련.]
(규칙을 몰라도 스스로 진화하는 AI)
가장 확률적으로 높은 6~7가지만 구현. => 정확도가 의외로 높다.

[1-13. 알파폴드2 - 바이오 분야]
- 질병의 단백질 구조를 예측. (기존 것을 학습.) 예) 코로나19

[1-14. GAN(생성적 적대 신경망)] (Generative Adversarial Network)
: (진짜 같은 가짜를 생성.)

[1-15. GPT-3] (Generation Pre-tained Transformer 3)
: 글을 생성해 내는 ai (ai 언어 생성 모델)

[1-16. 머신러닝이 적용된 인공지능 기술들]
1) 구글 웨이모 자율주행택시 (4단계 특정 지역)
(* 5단계는 모든 지역)

2) AI 로봇개
보스톤다이나믹스

3) 가상인간 ROZY

4) 오이분류인공지능 (TensorFlow - 95% 정확도)

5) 인공지능 챗봇

6) 멸종위기 동물 탐색 및 보호 (드론으로 바다 항공 사진 찍고, 인공지능 활용 -> 자동 판별.)

7) 인공지능 기자 / 앵커

8) 시각장애인 지원 인공지능 (Seeing AI)

9) 가방진품가품 판별 인공지능

10) 암 진단 인공지능 (가장 유망받는.)

11) 인공지능 시인

12 ) 인공지능 동양화가

