<3. 인공지능 윤리 가이드라인과 AI와 인간의 공존>

- 세계 인공지능 윤리 규정 및 지침들
[로봇 3원칙 (아이작 아시모프)]

1. 제 1법칙:

2. 제 2법칙:

3. 제 3법칙:

4. 제 0법칙:

[로봇 윤리 13원칙]

[영국 EPSRC의 로봇 원칙]
1.  EPSRC 로봇 원칙
2. 공공데이터 윤리 프레임워크

[ 자율주행차 윤리 가이드라인 ]
.. 인간의 생명보호가 항상 최우선 순위.
.. 자율주행시스템은 생명에 대한 가치 판단 및 선택을 하지 말아야 한다.
.. 모든 것은 기록되어야 한다.

[ 인간 중심의 AI 사회 원칙 (일본 내각부)]

[인공지능의 윤리적 발전을 위한 결의안 531 (미국 하원)]

[AI와 알고리즘 이용에 대한 지침]
1. ai 및 알고리즘 활용의 투명성 제고
2. ..

- 
.. 프라이버시 존중 등 8개 구정

[(중요) 아실로마 AI 원칙]
https://futureoflife.org
..
6. 안전
..
10. 가치관 정렬
..
12. 개인정보 보호
..
14. 공동이익
15. 공동번영
..
18. 인공지능 무기 경쟁

[IEEE 인공지능의 윤리적 설계 계획]

[신뢰할 수 있는 AI 윤리 가이드라인 (EU 집행위원회)]

[구글 AI 원칙]

[미 국방성 인공지능 개발 윤리 기준]

[국내 인공지능 윤리 규정 및 지침들]
- 카카오 알고리즘 윤리헌장

[KAIEA 인공지능 윤리 헌장]
- 원칙
- 제 1장 인간과 인공지능의 관계
- 제 2장 선하고 안전한 인공지능
- 제 3장 인공지능 개발자의 윤리
..
제29조. 개발자 또는 개발회사는 소비자에게 제품과 서비스에
인공지능 기술이 적용되어 있음을 표지나 문서, 음성 등으로
사전에 고지해야 한다.

- 제 4장 인공지능 소비자의 윤리

- 제 5장  공동의 책임과 이익의 공유

[인공지능 윤리의 2가지 오해]

[AI 기술과 AI윤리와의 관계]

[인공지능 윤리의 구분]
- 기계 / 인간의 윤리
1.
2.
3.

[선하고 안전한 인공지능 만드는 방법]
1. 
2.
3.